src/test/resources/poll.xml

<?xml version='1.0' encoding='UTF-8'?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
    <s:Body>
		<m:getPoll xmlns:m="www.itm.uniluebeck.de/pollservice">
			<pollId>1</pollId>
			<languageCode>en</languageCode>
		</m:getPoll>
    </s:Body>
</s:Envelope>
