mydoodle/src/test/resources/polls.xml

<?xml version='1.0' encoding='UTF-8'?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
    <s:Body>
		<m:getPolls xmlns:m="www.itm.uniluebeck.de/pollservice">
			<languageCode>de</languageCode>
		</m:getPolls>
    </s:Body>
</s:Envelope>
